{"all_awardings":{"0":[],"1":[],"2":[],"3":null},"allow_live_comments":{"0":false,"1":false,"2":null,"3":null},"author":{"0":"Jerry512","1":"Jerry512","2":"Jerry512","3":"Jerry512"},"author_flair_css_class":{"0":null,"1":null,"2":null,"3":null},"author_flair_richtext":{"0":[],"1":[],"2":[],"3":[]},"author_flair_text":{"0":null,"1":null,"2":null,"3":null},"author_flair_type":{"0":"text","1":"text","2":"text","3":"text"},"author_fullname":{"0":"t2_35ks80y8","1":"t2_35ks80y8","2":"t2_35ks80y8","3":"t2_35ks80y8"},"author_patreon_flair":{"0":false,"1":false,"2":false,"3":false},"author_premium":{"0":false,"1":null,"2":null,"3":null},"awarders":{"0":[],"1":[],"2":null,"3":null},"can_mod_post":{"0":false,"1":false,"2":false,"3":false},"contest_mode":{"0":false,"1":false,"2":false,"3":false},"created_utc":{"0":1581500613,"1":1570960850,"2":1557413856,"3":1549327519},"domain":{"0":"self.The_Donald","1":"self.The_Donald","2":"self.The_Donald","3":"self.WorldOfWarships"},"full_link":{"0":"https:\/\/www.reddit.com\/r\/The_Donald\/comments\/f2ou85\/do_not_embrace_the_yang_gang_theyll_do_to_maga\/","1":"https:\/\/www.reddit.com\/r\/The_Donald\/comments\/dh8ng8\/tucker_carlson_why_the_nba_kowtowed_to_china_and\/","2":"https:\/\/www.reddit.com\/r\/The_Donald\/comments\/bmkt39\/why_obama_had_to_have_known_and_authorized_the\/","3":"https:\/\/www.reddit.com\/r\/WorldOfWarships\/comments\/an8ivs\/whos_better_american_or_japanese_and_how_the\/"},"gildings":{"0":{},"1":{},"2":{},"3":{"gid_1":0,"gid_2":0,"gid_3":0}},"id":{"0":"f2ou85","1":"dh8ng8","2":"bmkt39","3":"an8ivs"},"is_crosspostable":{"0":false,"1":false,"2":true,"3":true},"is_meta":{"0":false,"1":false,"2":false,"3":false},"is_original_content":{"0":false,"1":false,"2":false,"3":false},"is_reddit_media_domain":{"0":false,"1":false,"2":false,"3":false},"is_robot_indexable":{"0":false,"1":true,"2":true,"3":true},"is_self":{"0":true,"1":true,"2":true,"3":true},"is_video":{"0":false,"1":false,"2":false,"3":false},"link_flair_background_color":{"0":"","1":"","2":"","3":""},"link_flair_richtext":{"0":[],"1":[],"2":[],"3":[]},"link_flair_text_color":{"0":"dark","1":"dark","2":"dark","3":"dark"},"link_flair_type":{"0":"text","1":"text","2":"text","3":"text"},"locked":{"0":false,"1":false,"2":false,"3":false},"media_only":{"0":false,"1":false,"2":false,"3":false},"no_follow":{"0":true,"1":true,"2":true,"3":true},"num_comments":{"0":0,"1":7,"2":0,"3":26},"num_crossposts":{"0":0,"1":0,"2":0,"3":0},"over_18":{"0":false,"1":false,"2":false,"3":false},"parent_whitelist_status":{"0":"no_ads","1":"no_ads","2":"no_ads","3":"all_ads"},"permalink":{"0":"\/r\/The_Donald\/comments\/f2ou85\/do_not_embrace_the_yang_gang_theyll_do_to_maga\/","1":"\/r\/The_Donald\/comments\/dh8ng8\/tucker_carlson_why_the_nba_kowtowed_to_china_and\/","2":"\/r\/The_Donald\/comments\/bmkt39\/why_obama_had_to_have_known_and_authorized_the\/","3":"\/r\/WorldOfWarships\/comments\/an8ivs\/whos_better_american_or_japanese_and_how_the\/"},"pinned":{"0":false,"1":false,"2":false,"3":false},"pwls":{"0":0,"1":0,"2":0,"3":6},"removed_by_category":{"0":"automod_filtered","1":null,"2":null,"3":null},"retrieved_on":{"0":1581500614,"1":1570960851,"2":1557413857,"3":1549327520},"score":{"0":1,"1":353,"2":5,"3":1},"selftext":{"0":"[removed]","1":"[https:\/\/www.youtube.com\/watch?v=lskKueJMvZg](https:\/\/www.youtube.com\/watch?v=lskKueJMvZg)\n\nI think we all suspected this for a long time - in the end, all evil machinations are connected.\n\nBut this is the first time I've seen someone in Big Media actually articulate it this concisely, connecting the dots between Obama and Trump, China and Lebron James, Nike and TPP, etc.\n\nBravo to Tucker Carlson and Jason Whitlock.","2":"Why Obama could not possibly have been \"ignorant\" about the spy operation and attempted coup against Trump...and why Trump almost certainly wasn't the only target of the operation, but was only one of a spectrum of candidates who was spied on.\n\n&amp;#x200B;\n\n[https:\/\/www.youtube.com\/watch?v=ITvnDtuRIgM](https:\/\/www.youtube.com\/watch?v=ITvnDtuRIgM)","3":"It crops up over and over again in one form or another.\n\n&amp;#x200B;\n\nRecently, it's come up again due to the recent CV rework, where people claimed  Japanese \"AA ships\" had radar and powered mounts and that they should be given DFAA since apparently the Japanese were every bit as good as the Americans...\n\n&amp;#x200B;\n\nI got tired of it (I had a rough day too).\n\n&amp;#x200B;\n\nSo are the Americans or the Japanese better?  And did the Japanese actually have AA even APPROACHING what WoWs gives them now in the game?\n\n&amp;#x200B;\n\nThe two questions are - in fact - as inseparable as they are profound in their answers.  People use proxies like these games to \n\n&amp;#x200B;\n\nFirst, let's talk about those Japanese gunnery systems so we can compare them to the USN gunnery SUBsystem and overall fire control system. \n\n&amp;#x200B;\n\nHow did the Japanese gunnery system work?\n\n&amp;#x200B;\n\nUpon initial spotting, they used optical range-finders.  What are these?  They're telescopic lenses you look through which create a singular image (not like binoculars) and are located at multiple positions of the ship (usually elevated and SEPARATED from the gun mounts).  Then these several Japanese sailors (part of a team of 7+) make guesstimations such as ship size\/class, wake size and direction, Relative speed, course, etc. Then they have to compare the readings with range tables, averaging them all, and translate that into actual measurements for the guns.  They have to translate it to gun bearings, elevation, moving the guns in MANUAL to turn the gun servos (VERY slowly).  Then they have to WAIT for their ship's pitch and roll to align with the proper reference at which they took those initial optical readings.  Japanese guns have NO automatic gyroscopic stabilization, they literally have to wait for the ship to pitch and roll to a convenient alignment (don't even ask what vibration at flank speed does to the platform) as the pilot\/navigation team is restricted from making radical maneuvers, parallax problems, lack of electrical instrumentation and tolerances...etc, etc, etc.\n\n&amp;#x200B;\n\nThe Japanese do not and CANNOT account for HUGE factors and errors in their \"Fire-Control Solution\" -  perhaps most importantly, the problem of TIME.\n\n&amp;#x200B;\n\nIn real life?  Even after their initial salvos, Japanese ships couldn't recalculate and correct fast or accurately enough for splash correction to keep up with whatever \"theoretical\" firing rate their guns were supposedly capable of (although their misses were undoubtedly very colorful aside from the battleship shells which were white).\n\n&amp;#x200B;\n\nResult?  The Japanese NEVER effectively fired their guns at the supposed \"firing rate\" you see in WoWs.  When they tried, they were firing BLINDLY.  At both air and surface targets, which in some cases like Leyte was WORSE than not firing at all.  In reality, the theoretical firing rate of Japanese ships was just that.\n\n&amp;#x200B;\n\nA \"Pipe dream\".\n\n&amp;#x200B;\n\nThat's why  Americans around the US Navy were wizened to the lack of Japanese aptitude, knew that \"chasing splashes\" would work against the Japanese.  They ALSO knew that such tactics as \"chasing splashes\" would never work on their OWN integrated, radar-and-computer-controlled gunnery (more on that later).\n\n&amp;#x200B;\n\nThat's Jap gunnery in World War 2.  \n\n&amp;#x200B;\n\nFrom the opening salvos of the war when the Japanese had to send their carriers and aircraft after the USS Edsall when their entire fleet fired on and failed to sink her - a fiasco so embarrassing that the entire Japanese Navy (to a man) covered up the event and executed the survivors of the Edsall crew - to the Battle of Samar when the last ship-to-ship gun battles demonstrated the reality of hopelessly out-matched Japanese crews, who were only able to hit their targets when they got within FOUR MILES of the American ships, WELL within the American 5-inch range, to the point where a US ESCORT CARRIER WAS OUTSHOOTING AND KILLING A JAPANESE HEAVY CRUISER WITH AA ARMAMENTS.\n\n&amp;#x200B;\n\nTo many laymen and historians, these episodes are absolutely mind-boggling.\n\n&amp;#x200B;\n\nBut that's largely because they look at the situations ON PAPER (in THEORY).\n\n&amp;#x200B;\n\nBut if they looked at these (and other) events under the premise of Physics and Engineering - under the correct premise of \"What Happened?\" rather than a false, hypothetical premise of \"What If\" - they'd see that these events are logical eventualities.\n\n&amp;#x200B;\n\nBecause even if they can't admit the Jap crews were inferior to the Americans, well, TOO BAD because the Japanese THEMSELVES admitted as much.\n\n&amp;#x200B;\n\nThe Japs knew their gunnery was inferior, despite all their false pride.\n\n&amp;#x200B;\n\nThroughout the war, their sailors and air crew witnessed how accurate American surface and AA gunnery was.  They also witnessed their OWN gunnery and made OBVIOUS conclusions.  \n\n&amp;#x200B;\n\nTHAT was why the Japanese were always gunning for a \"Night Fight\" in WW2, because by getting into close distances using the cover of night, the horrible aim of their gun system and crews wouldn't matter.  For all their pretensions of \"Yamato Damashii\", the Japanese command knew their ships, their crew, their guns, even their vaunted torpedoes would probably lose to a straight-up fight with the Americans (and they were right, because once the Americans realized the range of the Long Lance, the Japanese surface-launched torpedo kills became few and far between). \n\n&amp;#x200B;\n\nIt's no wonder all of the Japanese personnel clammed up AFTER the war.   Heck, the USN wasn't even sure what happened at the Japanese \"victory\" over the Edsall until someone discovered the beheaded remains of its crew years after the war ended as well as a Japanese reference document (lamenting the state of Japanese gunnery) that escaped the Japanese historical purge, while an entire population of Japanese officer and enlisted stubbornly insisted there were no survivors and that the Edsall crew all died at sea in the Indian Ocean.  \n\n&amp;#x200B;\n\nBy the way, American vets always asserted - rightly -  that they were better shots (and technicians) than the Japs.\n\n&amp;#x200B;\n\nTo the consternation and feigned ignorance of many 60s generation idiots.\n\n&amp;#x200B;\n\nSo how about those American guns?\n\n&amp;#x200B;\n\nMoreover, how about that American gun SYSTEM?\n\n&amp;#x200B;\n\nMoreover, how about those American gun crews \\[and technicians\\]?\n\n&amp;#x200B;\n\nBecause while many people in WoWs like to isolate the Historic Crew from the Historic Ships, REAL sailors and Engineers know that such isolation is ignorant and professionally delusional and ruinous.  The Culture of the crew was responsible for, and inseparable from the ship.  And as everything is downstream from Culture, so it was with the ship's logisitcs, its technology, and its combat proficiency.\n\n&amp;#x200B;\n\nWhether the Jap or American crews were \"Better-trained\", is beside the point compared to WHAT they were trained in.  The cultural difference is STARK.\n\n&amp;#x200B;\n\nThere is a difference between a soldier \"well-trained\" in Swordsmanship, while the other is \"well-trained\" in Marksmanship, ESPECIALLY when the field of battle is in an Industrial Era, NOT a Feudal one.  Or in this case, Automatic Fire Control and technical aptitude, competing against Optical Fire Control and \"guesstimation\" as the war-winning skill in Naval gunnery (and Modern industry as the veterans of the superior Engineering Culture would return home to build our world).   \n\n&amp;#x200B;\n\nThe biggest part of the American gunner's input is in maintenance and operation of a completely revolutionary Fire-Control system comprising integrated-systems that were ahead of their time. \n\n&amp;#x200B;\n\nThe age of \"Systems Engineering\" had come to the United States long ago, long before it came to any other country \\[and thus Navy\\].  Although they didn't call it that at the time, the concept-made-reality is more important than the \"Names\" they would later be known by:  \"Control Engineering\", \"Process Engineering\", \"Systems Engineering\", \"Signal Processing\", the \"Fire Control Technician\" and the \"Combat Systems Officer\", \"Combat Information Center\", \"maintenance schedules\" and \"Technical Support\", etc, etc, etc\n\n&amp;#x200B;\n\nBut it was all basically a cultural revolution where military prowess became inseparably linked to technologically competence and ingenuity.\n\n&amp;#x200B;\n\nBecause \"Technology\" and \"Innovation\" is downstream from \"Culture\".\n\n&amp;#x200B;\n\nThis is what the Japanese lacked.\n\n&amp;#x200B;\n\nBut it permeated through all of America's institutions.\n\n&amp;#x200B;\n\nThese Americans don't train or fight like the Japanese; they don't \"read\" the sight picture or any optical range finder or make guesses or need to tell anyone ANYTHING in the gun mounts.  They are experts at maintenance and repair of sophisticated machines.  They understand technology that the Japanese have not yet CONCEIVED of.\n\n&amp;#x200B;\n\nThe COMPUTER \"sees\" and \"tells\" the guns - at literal light-speed.\n\n&amp;#x200B;\n\nThe RADAR's receiver, adjacent to the superheterodyne amplifier and connected by waveguide assemblies, are fed DIRECTLY to an analog computer (not a human) for interpretation.  They are AUTOMATICALLY compared to the ship's reference through a system of gyroscopes which is the reason for the \"dancing barrels\" which move and align PRECISELY with an imaginary point in 3D space as the ship buckles, pitches and rolls in the waves.  \n\n&amp;#x200B;\n\nThat's why American ships were able to shoot with devastating accuracy whilst maneuvering VIOLENTLY throughout World War 2 - while the Japs either made themselves even EASIER targets for American guns by maintaining steady headings and speed with only minor changes (so as not to throw off their own un-stabilized gun guesstimations), or maneuvered too radically and made their own guns inaccurate.\n\n&amp;#x200B;\n\nWell OK, MORE inaccurate.\n\n&amp;#x200B;\n\nBut the USN Fire Control System accounts for and ADAPTS to these maneuvers - it is the \"Mona Lisa\" of Control  and Systems Engineering.  Von Braun's solution was a crude \"finger-painting\" by comparison.\n\n&amp;#x200B;\n\nEverything is accounted for, powder temperature, humidity, Dew point, Parallax.  Even the milliseconds delay between the closing of the firing circuit and the projectile leaving the gun muzzle and the rotation of the Earth (which wasn't really as necessary as they thought, but NM).  The bearing and elevation are extrapolated as the error-rate between \"Where the target is\" and \"Where the Guns are pointed\" drives the Gun's servos with Amplidyne-powered speed (THREE ORDERS OF MAGNITUDE more powerful than their Japanese counterparts - Four, depending on where in the system you're measuring) until the error is gone.\n\n&amp;#x200B;\n\n\"Zeroed-In\"\n\n&amp;#x200B;\n\nI could go on, but any Engineer can appreciate the history, the genius, the ART.  \n\n&amp;#x200B;\n\nThere is NO comparison between this and any other system.\n\n&amp;#x200B;\n\nIn the Engineering world, this is pure Pwnage.\n\n&amp;#x200B;\n\nIt's a HISTORIC system, an innovation on the order of the steam engine and airplane, born from a culture of pure F\\*cking genius: Naval Research Weapons, Rad Lab, Bell Labs, Ford Instruments, etc, etc, etc, all of who's engineering trees and legacy continue today in one form or another in General Dynamics, General Electric, Lockheed, Honeywell, Google (F\\*ck!), etc, etc, etc. \n\n&amp;#x200B;\n\nIt was even made FULLY automatic in testing (a matter of sampling, engagement criteria and closing the firing circuit), a \"ROBOT\" that could \"see\", \"remember\", \"decide\", \"adapt\" and \"act\" without human asynchronous inputs beyond its initial programming (though for obvious reasons, the Navy decided to maintain a \"Manual\" firing standard).\n\n&amp;#x200B;\n\nIt's a closed-loop feedback system, continuous and self-correcting:\n\n&amp;#x200B;\n\nThe world's first true Robot.  \n\n&amp;#x200B;\n\nIt runs the flow chart and back.\n\n&amp;#x200B;\n\nIt is the Grandfather of all Robots today, from the industrial robots which build everything from your integrated chips to your cars, to the cooling fans in your computer which speed up and slow down to regulate temperature.\n\n&amp;#x200B;\n\nAnd its first iteration was installed on the USS Sims...\n\n&amp;#x200B;\n\n....in 1939.\n\n&amp;#x200B;\n\n(credit WG who initially gave the Sims' radical robotic system its due)\n\n&amp;#x200B;\n\nJapan was decades behind while America was developing everything from semiconductors to modern fabrication processes in the 30s.  She just didn't know it yet.\n\n&amp;#x200B;\n\nShe was not alone.\n\n&amp;#x200B;\n\nAnd at war's end in 1945, still no other country came close to the Sims' system, let alone the updated Mark 37, let alone the industrial and technological infrastructure that would spawn and dominate the computer age, the information age, the plastic age, etc, etc, etc; America developed the institutional knowledge (a generation in the making), the tooling, the skilled labor, the standardization, the principles of stability, signal processing, metallurgical processes, manufacturing tolerances, THE PRINCIPLES THAT REQUIRED\/GAVE-REASON TO DEVELOP THOSE TOLERANCES, etc, etc, etc.\n\n&amp;#x200B;\n\nYes, it marks the birth of Engineering disciplines from \"Control Engineering\" to \"Systems Engineering\", born in the USA  before WW2 (by reckoning of the Sino-Japanese conflict).  From integrated transistors to modern programming languages.  Which is why every Engineer in the world learns Nyquist, Ohl, Bode, etc, alongside Newton, Boole, Gauss, etc. \n\n&amp;#x200B;\n\nEVERY would-be Engineer in the world learns it, whether they acknowledge it or not.\n\n&amp;#x200B;\n\nThere are no Japanese names in that Engineering Pantheon we learn in school.\n\n&amp;#x200B;\n\nNo Aerospace engineer has anything to learn from Jiro Horikoshi (Aside from what NOT to do), nor Process engineer anything to learn from Sumitomo Metal\\*\n\n&amp;#x200B;\n\n\\*No, they did not invent the 7075 (AA) alloy or process, and anyone who uses Sumitomo's process instead of Alcoa's will be sued out of existence by everyone including the Japanese.  There's a reason why vintage (as opposed to \"replicas\" built post-war with modern alloys) Zeros don't fly today, while you can see vintage American WW2 aircraft flying at your local air shows.\n\n&amp;#x200B;\n\nAmericans (with a skilled military veteran and weapons-developer base from Seymour Cray to Grace Hopper) inevitably dominated technology after WW2 unto this day - for the simple reason that they were its Source.\n\n&amp;#x200B;\n\nIt is why countries developed so differently even though they started with the same genetic and cultural stock at the end of WW2; West Germany and East Germany, Republic of China and People's Republic of China, South Korea and North Korea, South Vietnam and North Vietnam (well, until the North conquered the South), etc, etc, etc. \n\n&amp;#x200B;\n\nIt is also the reason for their Resentment - and the Lies.\n\n&amp;#x200B;\n\nBottom line: the Japanese were technologically primitive - and from their Zero to their Yamato, have been overrated ever since by illiterates and frauds alike (the old song about \"double-downing\" on existing technology because you LACKED THE ABILITY to innovate new technology).\n\n&amp;#x200B;\n\nPut it all together, and this is why American gunners out-dueled their Japanese counterparts in WW2, why American air crews found the Japanese tracer shells scary (naturally) but wildly inaccurate and ineffective (comparably), why American equipment captured by the Japanese ended up being connected to manual dials and simple synchros instead of computers and control transformers, why American engineers and industrialists had to teach the Japanese - from scratch - how to build (and govern) a technologically advanced nation during and after the Occupation, etc, etc, etc.\n\n&amp;#x200B;\n\nAnd that obvious fact has been waffled on, danced around, or been masked by bald-faced lies by \"multicultural\" historians, long after WW2 vets MADE history and proved the essential Truth.  Heck, some vets stated quite plainly that they were better shots than the Japanese (well, 'duh'), better electrical and computer technicians ('DUH')- \n\n&amp;#x200B;\n\n\\- and I would add \"Better Men in both War and Peace\".\n\n&amp;#x200B;\n\n(It's disgusting that so many Americans find that last so counter-intuitive, even more disgusting that many pretend it is \"False\")"},"send_replies":{"0":true,"1":true,"2":true,"3":true},"spoiler":{"0":false,"1":false,"2":false,"3":false},"stickied":{"0":false,"1":false,"2":false,"3":false},"subreddit":{"0":"The_Donald","1":"The_Donald","2":"The_Donald","3":"WorldOfWarships"},"subreddit_id":{"0":"t5_38unr","1":"t5_38unr","2":"t5_38unr","3":"t5_2t8uj"},"subreddit_subscribers":{"0":788847,"1":777426,"2":742082,"3":45104},"subreddit_type":{"0":"public","1":"public","2":"public","3":"public"},"thumbnail":{"0":"self","1":"self","2":"self","3":"self"},"title":{"0":"DO NOT EMBRACE THE YANG GANG - They'll do to MAGA what Californians did to Colorado","1":"Tucker Carlson: Why the NBA kowtowed to China, and why they hate Trump.","2":"Why Obama had to have known and authorized the Spy operation against Trump - and why Trump wasn't the only candidate Obama spied on","3":"Who's Better? American or Japanese? And how the answer shaped Engineering - and the World."},"total_awards_received":{"0":0.0,"1":0.0,"2":0.0,"3":null},"url":{"0":"https:\/\/www.reddit.com\/r\/The_Donald\/comments\/f2ou85\/do_not_embrace_the_yang_gang_theyll_do_to_maga\/","1":"https:\/\/www.reddit.com\/r\/The_Donald\/comments\/dh8ng8\/tucker_carlson_why_the_nba_kowtowed_to_china_and\/","2":"https:\/\/www.reddit.com\/r\/The_Donald\/comments\/bmkt39\/why_obama_had_to_have_known_and_authorized_the\/","3":"https:\/\/www.reddit.com\/r\/WorldOfWarships\/comments\/an8ivs\/whos_better_american_or_japanese_and_how_the\/"},"whitelist_status":{"0":"no_ads","1":"no_ads","2":"no_ads","3":"all_ads"},"wls":{"0":0,"1":0,"2":0,"3":6},"post_hint":{"0":null,"1":"self","2":"self","3":null},"preview":{"0":null,"1":{"enabled":false,"images":[{"id":"7NRNKEzN4AMNzVfBl9ezkQ3QyLfxCKYnNNqcrX2KuGo","resolutions":[{"height":81,"url":"https:\/\/external-preview.redd.it\/B9hvYhexRdsRBO2gY4o9_9mX-8fNGLRGNLtyCveEplw.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=fdb6c3563a661b2709655c2b24be7880888a6cd2","width":108},{"height":162,"url":"https:\/\/external-preview.redd.it\/B9hvYhexRdsRBO2gY4o9_9mX-8fNGLRGNLtyCveEplw.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=5f83e88099367a5526cc01c4d1975e867ea4ba42","width":216},{"height":240,"url":"https:\/\/external-preview.redd.it\/B9hvYhexRdsRBO2gY4o9_9mX-8fNGLRGNLtyCveEplw.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=22e4a9cb40f8fd72108f1b5ab11924e7c9fd91ac","width":320}],"source":{"height":360,"url":"https:\/\/external-preview.redd.it\/B9hvYhexRdsRBO2gY4o9_9mX-8fNGLRGNLtyCveEplw.jpg?auto=webp&amp;s=67b8e0387ab2c85e527ff2e53d73ffa1bd4675f4","width":480},"variants":{}}]},"2":{"enabled":false,"images":[{"id":"kmr869Xre7CDGcGJ0-YoBNghNnzCjTL8pTby5d4yxsk","resolutions":[{"height":81,"url":"https:\/\/external-preview.redd.it\/d0cRLtiLNu7O7hYVU9fHZTDsp0tjH0ZmiD1m7pGgn00.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=00d57f021415650222317731db5df700c2b349ca","width":108},{"height":162,"url":"https:\/\/external-preview.redd.it\/d0cRLtiLNu7O7hYVU9fHZTDsp0tjH0ZmiD1m7pGgn00.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=2f94b4138bd9a5d65b9635c5eef8f0607b83750a","width":216},{"height":240,"url":"https:\/\/external-preview.redd.it\/d0cRLtiLNu7O7hYVU9fHZTDsp0tjH0ZmiD1m7pGgn00.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=f80d82877e6011f8be6306de05d0cb69f4176614","width":320}],"source":{"height":360,"url":"https:\/\/external-preview.redd.it\/d0cRLtiLNu7O7hYVU9fHZTDsp0tjH0ZmiD1m7pGgn00.jpg?auto=webp&amp;s=e0b49fb231bc8881e526f0dbe3d17b86b8f72fbb","width":480},"variants":{}}]},"3":null},"steward_reports":{"0":null,"1":[],"2":null,"3":null},"updated_utc":{"0":null,"1":1572043908.0,"2":1557646248.0,"3":null},"date":{"0":1581500613000,"1":1570960850000,"2":1557413856000,"3":1549327519000}}